tobliao/Microchip-Projects-MASTER-2025/lab3/src/packs/PIC32CM3204GV00048_DFP/pic32cm3204gv00048.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M0PLUS exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void SVCall_Handler                ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void PM_Handler                    ( void );
void SYSCTRL_Handler               ( void );
void WDT_Handler                   ( void );
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void NVMCTRL_Handler               ( void );
void EVSYS_Handler                 ( void );
void SERCOM0_Handler               ( void );
void SERCOM1_Handler               ( void );
void SERCOM2_Handler               ( void );
void SERCOM3_Handler               ( void );
void SERCOM4_Handler               ( void );
void SERCOM5_Handler               ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TC3_Handler                   ( void );
void TC4_Handler                   ( void );
void TC5_Handler                   ( void );
void ADC_Handler                   ( void );
void AC_Handler                    ( void );
void DAC_Handler                   ( void );
void PTC_Handler                   ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M0PLUS Processor and Core Peripherals */
#define __CM0PLUS_REV                 0x0001 /* Cortex-M0+ Core Revision                                                  */
#define __MPU_PRESENT                      0 /* MPU present or not                                                        */
#define __NVIC_PRIO_BITS                   2 /* Number of Bits used for Priority Levels                                   */
#define __VTOR_PRESENT                     1 /* Vector Table Offset Register present or not                               */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

/* CMSIS includes */
#include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cmgv00.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*         SOFTWARE PERIPHERAL API DEFINITIONS FOR PIC32CM3204GV00048         */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/dac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/nvmctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/ptc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/sysctrl.h"
#include "component/tc.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*                INSTANCE DEFINITIONS FOR PIC32CM3204GV00048                 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/dac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/nvmctrl.h"
#include "instance/pac0.h"
#include "instance/pac1.h"
#include "instance/pac2.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/ptc.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/sysctrl.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/tc4.h"
#include "instance/tc5.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*              PERIPHERAL ID DEFINITIONS FOR PIC32CM3204GV00048              */
/* ************************************************************************** */
#define ID_PAC0          (  0) /* Peripheral Access Controller (PAC0) */
#define ID_PM            (  1) /* Power Manager (PM) */
#define ID_SYSCTRL       (  2) /* System Control (SYSCTRL) */
#define ID_GCLK          (  3) /* Generic Clock Generator (GCLK) */
#define ID_WDT           (  4) /* Watchdog Timer (WDT) */
#define ID_RTC           (  5) /* Real-Time Counter (RTC) */
#define ID_EIC           (  6) /* External Interrupt Controller (EIC) */
#define ID_PAC1          ( 32) /* Peripheral Access Controller (PAC1) */
#define ID_DSU           ( 33) /* Device Service Unit (DSU) */
#define ID_NVMCTRL       ( 34) /* Non-Volatile Memory Controller (NVMCTRL) */
#define ID_PORT          ( 35) /* Port Module (PORT) */
#define ID_PAC2          ( 64) /* Peripheral Access Controller (PAC2) */
#define ID_EVSYS         ( 65) /* Event System Interface (EVSYS) */
#define ID_SERCOM0       ( 66) /* Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       ( 67) /* Serial Communication Interface (SERCOM1) */
#define ID_SERCOM2       ( 68) /* Serial Communication Interface (SERCOM2) */
#define ID_SERCOM3       ( 69) /* Serial Communication Interface (SERCOM3) */
#define ID_SERCOM4       ( 70) /* Serial Communication Interface (SERCOM4) */
#define ID_SERCOM5       ( 71) /* Serial Communication Interface (SERCOM5) */
#define ID_TC0           ( 72) /* Basic Timer Counter (TC0) */
#define ID_TC1           ( 73) /* Basic Timer Counter (TC1) */
#define ID_TC2           ( 74) /* Basic Timer Counter (TC2) */
#define ID_TC3           ( 75) /* Basic Timer Counter (TC3) */
#define ID_TC4           ( 76) /* Basic Timer Counter (TC4) */
#define ID_TC5           ( 77) /* Basic Timer Counter (TC5) */
#define ID_ADC           ( 80) /* Analog Digital Converter (ADC) */
#define ID_AC            ( 81) /* Analog Comparators (AC) */
#define ID_DAC           ( 82) /* Digital Analog Converter (DAC) */
#define ID_PTC           ( 83) /* Peripheral Touch Controller (PTC) */

#define ID_PERIPH_MAX    ( 83) /* Number of peripheral IDs */

/* ************************************************************************** */
/*       REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CM3204GV00048        */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42004400)                 /* AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x42004000)                /* ADC Registers Address        */
#define DAC_REGS                         ((dac_registers_t*)0x42004800)                /* DAC Registers Address        */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40001800)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x42000400)              /* EVSYS Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40000c00)               /* GCLK Registers Address       */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /* NVMCTRL Registers Address    */
#define OTP4_FUSES_REGS                  ((fuses_otp4_fuses_registers_t*)0x00806020)   /* FUSES Registers Address      */
#define TEMP_LOG_FUSES_REGS              ((fuses_temp_log_fuses_registers_t*)0x00806030) /* FUSES Registers Address      */
#define USER_FUSES_REGS                  ((fuses_user_fuses_registers_t*)0x00804000)   /* FUSES Registers Address      */
#define PAC0_REGS                        ((pac_registers_t*)0x40000000)                /* PAC0 Registers Address       */
#define PAC1_REGS                        ((pac_registers_t*)0x41000000)                /* PAC1 Registers Address       */
#define PAC2_REGS                        ((pac_registers_t*)0x42000000)                /* PAC2 Registers Address       */
#define PM_REGS                          ((pm_registers_t*)0x40000400)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x41004400)               /* PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /* PORT Registers Address       */
#define PTC_REGS                         ((ptc_registers_t*)0x42004c00)                /* PTC Registers Address        */
#define RTC_REGS                         ((rtc_registers_t*)0x40001400)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000800)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000c00)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42001000)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42001400)             /* SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x42001800)             /* SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x42001c00)             /* SERCOM5 Registers Address    */
#define SYSCTRL_REGS                     ((sysctrl_registers_t*)0x40000800)            /* SYSCTRL Registers Address    */
#define TC0_REGS                         ((tc_registers_t*)0x42002000)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42002400)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x42002800)                 /* TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x42002c00)                 /* TC3 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x42003000)                 /* TC4 Registers Address        */
#define TC5_REGS                         ((tc_registers_t*)0x42003400)                 /* TC5 Registers Address        */
#define WDT_REGS                         ((wdt_registers_t*)0x40001000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*              BASE ADDRESS DEFINITIONS FOR PIC32CM3204GV00048               */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x42004400)                          /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x42004000)                          /* ADC Base Address */
#define DAC_BASE_ADDRESS                 _UINT32_(0x42004800)                          /* DAC Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x41002000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x40001800)                          /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x42000400)                          /* EVSYS Base Address */
#define GCLK_BASE_ADDRESS                _UINT32_(0x40000c00)                          /* GCLK Base Address */
#define NVMCTRL_BASE_ADDRESS             _UINT32_(0x41004000)                          /* NVMCTRL Base Address */
#define OTP4_FUSES_BASE_ADDRESS          _UINT32_(0x00806020)                          /* FUSES Base Address */
#define TEMP_LOG_FUSES_BASE_ADDRESS      _UINT32_(0x00806030)                          /* FUSES Base Address */
#define USER_FUSES_BASE_ADDRESS          _UINT32_(0x00804000)                          /* FUSES Base Address */
#define PAC0_BASE_ADDRESS                _UINT32_(0x40000000)                          /* PAC0 Base Address */
#define PAC1_BASE_ADDRESS                _UINT32_(0x41000000)                          /* PAC1 Base Address */
#define PAC2_BASE_ADDRESS                _UINT32_(0x42000000)                          /* PAC2 Base Address */
#define PM_BASE_ADDRESS                  _UINT32_(0x40000400)                          /* PM Base Address */
#define PORT_BASE_ADDRESS                _UINT32_(0x41004400)                          /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UINT32_(0x60000000)                          /* PORT Base Address */
#define PTC_BASE_ADDRESS                 _UINT32_(0x42004c00)                          /* PTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x40001400)                          /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x42000800)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x42000c00)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x42001000)                          /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UINT32_(0x42001400)                          /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UINT32_(0x42001800)                          /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UINT32_(0x42001c00)                          /* SERCOM5 Base Address */
#define SYSCTRL_BASE_ADDRESS             _UINT32_(0x40000800)                          /* SYSCTRL Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x42002000)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x42002400)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x42002800)                          /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UINT32_(0x42002c00)                          /* TC3 Base Address */
#define TC4_BASE_ADDRESS                 _UINT32_(0x42003000)                          /* TC4 Base Address */
#define TC5_BASE_ADDRESS                 _UINT32_(0x42003400)                          /* TC5 Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x40001000)                          /* WDT Base Address */

/* ************************************************************************** */
/*                   PIO DEFINITIONS FOR PIC32CM3204GV00048                   */
/* ************************************************************************** */
#include "pio/pic32cm3204gv00048.h"

/* ************************************************************************** */
/*             MEMORY MAPPING DEFINITIONS FOR PIC32CM3204GV00048              */
/* ************************************************************************** */
#define FLASH_SIZE                     _UINT32_(0x00008000)    /*   32kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UINT32_(        64)
#define FLASH_NB_OF_PAGES              _UINT32_(       512)

#define CAL_SIZE                       _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define LOCKBIT_SIZE                   _UINT32_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UINT32_(0x000000e0)    /*    0kB Memory segment type: fuses */
#define OTP4_PAGE_SIZE                 _UINT32_(        64)
#define OTP4_NB_OF_PAGES               _UINT32_(         3)

#define TEMP_LOG_SIZE                  _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UINT32_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UINT32_(        64)
#define USER_PAGE_NB_OF_PAGES          _UINT32_(         4)

#define HRAMC0_SIZE                    _UINT32_(0x00001000)    /*    4kB Memory segment type: ram */
#define HPB0_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB1_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define PERIPHERALS_SIZE               _UINT32_(0x20000000)    /* 524288kB Memory segment type: io */

